/*===================================================================*/
/*            第四節　選択　          */
/* Date:2021.10.2(土)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　     　問題4：　　　 　　　　*/
/*             ISBN-10             */
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_04_04;

/* 指定した型の値を読み込むには外部のライブラリをインポートする必要がある */
/*            import宣言：import パッケージ名.クラス名             */
import java.util.Scanner;

/* "Isbn"クラスを作成 */
public class Isbn
{
    public static void main(String[] args)
    {
        /* 　　　オブジェクト生成 　　 */
        Scanner input = new Scanner(System.in);

        /* 9桁の数字を入力 */
        System.out.print("Enter the first 9 digits of an ISBN as integer: ");
        int isbn = input.nextInt();

        /* 第一桁から第九桁までの数字を取り出す(9回繰り返し) */
        int d1 = isbn / 100000000;
        int i = isbn % 100000000;

        int d2 = i / 10000000;
        i %= 10000000;

        int d3 = i / 1000000;
        i %= 1000000;

        int d4 = i / 100000;
        i %= 100000;

        int d5 = i / 10000;
        i %= 10000;

        int d6 = i / 1000;
        i %= 1000;

        int d7 = i / 100;
        i %= 100;

        int d8 = i / 10;
        i %= 10;

        int d9 = i;

        /* チェックディジット(d10)変数を宣言とチェックディジットを計算 */
        int d10 = (d1 * 1 + d2 * 2 + d3 * 3 + d4 * 4 + d5 * 5 + d6 * 6 + d7 * 7 + d8 * 8 + d9 * 9) % 11;

        /* 結果を出力 */
        /* チェックディジットは10の場合、"X"を出力 */
        if (d10 == 10)
        {
            System.out.println("The ISBN-10 number is " + d1 + d2 + d3 + d4 + d5 + d6 + d7 + d8 + d9 + "X");
        }

        /* チェックディジットは10でない場合、そのまま出力 */
        else
        {
            System.out.println("The ISBN-10 number is " + d1 + d2 + d3 + d4 + d5 + d6 + d7 + d8 + d9 + d10);
        }
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/