/*===================================================================*/
/*         第九節　配列　        */
/* Date:2021.10.4(月)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　　 問題2　　　　　　*/
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_09_02;

import java.util.Scanner;

public class Number
{
    public static void main(String[] args)
    {
        int[] array = new int[10];

        /*数字を入力*/
        System.out.print("10個の整数を入力:");

        /* 反転(inversion)関数を呼び出し */
        inversion(array);

        /* 結果を出力 */
        for (int i = array.length - 1; i >= 0; i--)
        {
            System.out.print(array[i] + " ");
        }
        System.out.println();
    }

    public static void inversion(int[] array)
    {
        Scanner input = new Scanner(System.in);

        for (int i = 0; i < array.length; i++)
        {
            array[i] = input.nextInt();
        }
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/