/*===================================================================*/
/* 第三節　Javaプログラミングの基礎　*/
/* Date:2021.10.2(土)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　     　問題6：　　　 　　　　*/
/*           数学運算問題            */
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_03_06;

/* 指定した型の値を読み込むには外部のライブラリをインポートする必要がある */
/*            import宣言：import パッケージ名.クラス名             */
import java.util.Scanner;

/* "Math_Keisan"クラスを作成 */
public class Math_Keisan
{
    public static void main(String[] args)
    {
        /* オブジェクト生成 */
        Scanner input = new Scanner(System.in);

        /* 千桁以内の整数を入力 */
        System.out.print("Enter a number between 0 and 1000: ");
        int number = input.nextInt();

        /* 整数を一桁位から引き抜く */
        int ones = number % 10;
        number /= 10;

        /* 整数を十桁位から引き抜く */
        int tens = number % 10;
        number /= 10;

        /* 整数を百桁位から引き抜く */
        int hundreds = number % 10;
        number /= 10;

        /* 引き抜いた数値を加算 */
        int sum = hundreds + tens + ones;

        /* 結果を出力 */
        System.out.println("The sum of the digits is " + sum);
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/