/*===================================================================*/
/* 第三節　Javaプログラミングの基礎　*/
/* Date:2021.10.2(土)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　     　問題7：　　　 　　　　*/
/*           利子運算問題            */
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_03_07;

/* 指定した型の値を読み込むには外部のライブラリをインポートする必要がある */
/*            import宣言：import パッケージ名.クラス名             */
import java.util.Scanner;

/* "Interest_Keisan"クラスを作成 */
public class Interest_Keisan
{
    public static void main(String[] args)
    {
        /* オブジェクト生成 */
        Scanner input = new Scanner(System.in);

        /* 残高と年利率を入力 */
        System.out.print("残高と年利率を入力:");

        /* 残高(balance)を宣言(一回目の入力) */
        double balance = input.nextDouble();

        /* 年利率(annualinterestrate)を宣言(二回目の入力) */
        double annualinterestrate = input.nextDouble();

        /* 利子(interest)を計算：利子 = 残高　* ( 年利率　/ 1200 ) */
        double interest = balance * (annualinterestrate / 1200);

        /* 結果を出力 */
        System.out.println("利子は" + interest);
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/