/*===================================================================*/
/* 第三節　Javaプログラミングの基礎　*/
/* Date:2021.10.2(土)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　　問題2：　　　　　　　*/
/*        円柱の体積           */
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_03_02;

/* 指定した型の値を読み込むには外部のライブラリをインポートする必要がある */
/*            import宣言：import パッケージ名.クラス名             */
import java.util.Scanner;

/* "Cylinder_Keisan"クラスを作成 */
public class Cylinder_Keisan
{
    public static void main(String[] args)
    {
        /* 　　　オブジェクト生成 　　 */
        Scanner input = new Scanner(System.in);

        /*                PI変数を宣言                   */
        /* ドットの後に7桁の数字で計算、つまりπ　= 3.1415927 */
        final double PI = 3.1415927;

        /* 半径(radius)と縦の長さ(length)を入力 */
        System.out.print("半径と縦の長さを入力:");

        /* 半径(radius)を宣言(一回目入力の値) */
        double radius = input.nextDouble();

        /* 縦の長さ(length)を宣言(二回目入力の値) */
        double length = input.nextDouble();

        /* 円柱の体積を計算 */
        /* 円の面積(area)を計算:半径 * 半径　* π */
        double area = radius * radius * PI;

        /* 円柱の体積を計算:円の面積 * 縦の長さ */
        double volume = area * length;

        /* 結果を出力 */
        System.out.println("円の面積は" + area);
        System.out.println("円柱の体積は" + volume);
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/