/*===================================================================*/
/*            第四節　選択　          */
/* Date:2021.10.2(土)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　     　問題7：　　　 　　　　*/
/*              三角形              */
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_04_07;

/* 指定した型の値を読み込むには外部のライブラリをインポートする必要がある */
/*            import宣言：import パッケージ名.クラス名             */
import java.util.Scanner;

/* "FingerGuessing"クラスを作成 */
public class Triangle
{
    public static void main(String[] args)
    {

        Scanner input = new Scanner(System.in);

        /* 　　　オブジェクト生成 　　 */
        System.out.println("三角形の辺の長さを入力:");

        /* 辺の長さを入力 */
        System.out.print("第一辺の長さを入力: ");
        double x = input.nextDouble();
        System.out.print("第二辺の長さを入力: ");
        double y = input.nextDouble();
        System.out.print("第三辺の長さを入力: ");
        double z = input.nextDouble();

        /* 二つの辺の長さの和は第三辺より短い及び等しい場合は三角形が成立せず */
        if ( x + y <= z || x + z <= y || y + z <= x)
        {
            System.out.println("三角形は成立しない");
        }

        /* 二つの辺の長さの和は第三辺より長い場合は三角形が成立 */
        else
        {
            System.out.println("三角形の外周は" + (x + y + z));
        }
    }
}


/*===================================================================*/
/* END */
/*===================================================================*/