/*===================================================================*/
/* 第三節　Javaプログラミングの基礎　*/
/* Date:2021.10.2(土)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　     　問題8：　　　 　　　　*/
/*         ドライブ費用問題           */
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_03_08;

/* 指定した型の値を読み込むには外部のライブラリをインポートする必要がある */
/*            import宣言：import パッケージ名.クラス名             */
import java.util.Scanner;

/* "Drive_Keisan"クラスを作成 */
public class Drive_Keisan
{
    public static void main(String[] args)
    {
        /* オブジェクト生成 */
        Scanner input = new Scanner(System.in);

        /* ドライブの距離を入力 */
        System.out.print("ドライブの距離: ");
        double distance = input.nextDouble();

        /* 1メートルにガスの消費量を入力 */
        System.out.print("1メートルにガスの消費量: ");
        double milespergas = input.nextDouble();

        /* 1ガロンの料金を入力 */
        System.out.print("1ガロンの料金: ");
        double pricepergallon = input.nextDouble();

        /* コストを計算 */
        double costofdrive = (distance / milespergas) * pricepergallon;

        /* 結果を出力 */
        System.out.println("コストは $" + costofdrive);
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/