/*===================================================================*/
/* 第三節　Javaプログラミングの基礎　*/
/* Date:2021.10.2(土)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　     　問題5：　　　 　　　　*/
/*             金額計算              */
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_03_05;

/* 指定した型の値を読み込むには外部のライブラリをインポートする必要がある */
/*            import宣言：import パッケージ名.クラス名             */
import java.util.Scanner;

/* "Money_Keisan"クラスを作成 */
public class Money_Keisan
{
    public static void main(String[] args)
    {
        /* 　　　オブジェクト生成 　　 */
        Scanner input = new Scanner(System.in);

        /* 元金と報酬率を入力 */
        System.out.print("Enter the subtotal and a gratuity rate: ");

        /* 元金(principal)を宣言(一回目入力の値) */
        double principal = input.nextDouble();

        /* 報酬率(rate)を宣言(二回目入力の値) */
        double rate = input.nextDouble();

        /* 報酬を計算：報酬 = 元金 * 報酬率 */
        double gratuity = principal * (rate / 100);

        /* 総費用を計算：総費用 = 元金 * 報酬 */
        double total = principal + gratuity;

        /* 結果を出力 */
        System.out.println("The gratuity is $" + gratuity + " and total is $" + total);
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/