/*===================================================================*/
/* 第三節　Javaプログラミングの基礎　*/
/* Date:2021.10.2(土)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　     　問題3：　　　 　　　　*/
/*  フィート(ft)からメートル(m)に変換  */
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_03_03;

/* 指定した型の値を読み込むには外部のライブラリをインポートする必要がある */
/*            import宣言：import パッケージ名.クラス名             */
import java.util.Scanner;

/* "Metre_Change"クラスを作成 */
public class Metre_Change
{
    public static void main(String[] args)
    {
        /* 　　　オブジェクト生成 　　 */
        Scanner input = new Scanner(System.in);

        /* Metre_Per_Foot変数を宣言 */
        /*      1ft = 0.305m      */
        final double Metre_Per_Foot = 0.305;

        /* フィート(ft)を入力 */
        System.out.print("Enter a value for feet: ");

        /* フィート(ft)を宣言(一回目入力の値) */
        double ft = input.nextDouble();

        /* メートル(m)に変換:m = ft * 0.305 */
        double m = ft * Metre_Per_Foot;

        /* 結果を出力 */
        System.out.println(ft + " feet is " + m + " meters");
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/