/*===================================================================*/
/*         第七節　Javaループ　        */
/* Date:2021.10.4(月)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　　 問題5：学費計算　　　　　　*/
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_07_05;

import java.util.Scanner;

public class Pay_For_Studying
{
    public static void main(String[] args)
    {
        /* オブジェクト生成 */
        Scanner input = new Scanner(System.in);

        System.out.println("将来の年:(10年以上に入力)");
        int n = input.nextInt();

        double oldprice = 1000;
        double sum = 0;

        for (int i = 1; i <= n; i++) {
            oldprice = oldprice * (1+0.07);
            if (i == 8)
            {
                double tem = oldprice;
                System.out.printf("今までの学費は: $%.1f",tem);
            }
            else if (i > 8){
                sum = sum + oldprice;
            }
        }
        System.out.printf("%n8年後からの新規学費は: $%.1f",sum);
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/