/*===================================================================*/
/*         第六節　文字と文字列　       */
/* Date:2021.10.4(月)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　 問題3：文字列チェック　　　　*/
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_06_03;

import java.util.Scanner;

public class Check_Words
{
    public static void main(String[] args)
    {
        /* オブジェクト生成 */
        Scanner input = new Scanner(System.in);

        /* 文字列を入力 */
        System.out.print("第一の文字列を入力: ");
        String word_1 = input.nextLine();
        System.out.print("第二の文字列を入力: ");
        String word_2 = input.nextLine();

        /* 比較してから結果を出力 */
        System.out.println(word_2 + "と" + word_1 + "は" + ((word_1.contains(word_2)) ? "同じ" : "同じではない"));
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/