/*===================================================================*/
/*         第七節　Javaループ　        */
/* Date:2021.10.4(月)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　　 問題1：平均値計算　　　　　　*/
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_07_01;

import java.util.Scanner;

public class Maths {

    public static void main(String[] args)
    {
        Scanner input = new Scanner(System.in);

        /* 正数の数を数える */
        int positives = 0;

        /* 負数の数を数える */
        int negatives = 0;

        /* 数字の数を数える */
        int count = 0;

        /* 和変数を宣言 */
        double total = 0;

        System.out.print("数を入力(最後に0を追加してください):");
        int number = input.nextInt();

        while (number != 0)
        {
            if (number > 0)
            {
                positives++;
            }
            else
            {
                negatives++;
            }
            total += number;
            count++;
            number = input.nextInt();
        }

        /* 平均値を計算 */
        double average = total / count;

        /* 結果を出力 */
        System.out.print("·正数の数は" + positives + "\n負数の数は" + negatives + "\n平均値は" + average);
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/