/*===================================================================*/
/* 第三節　Javaプログラミングの基礎　*/
/* Date:2021.10.2(土)　回答者：張 家銘 */
/*===================================================================*/

/*===================================================================*/
/* 　　　　      　問題4：　　　 　　　　*/
/*  ポンド(lb)からキログラム(kg)に変換  */
/*===================================================================*/

/*===================================================================*/
/* START */
/*===================================================================*/
package Homework_03_04;

/* 指定した型の値を読み込むには外部のライブラリをインポートする必要がある */
/*            import宣言：import パッケージ名.クラス名             */
import java.util.Scanner;

/* "Kilogram_Keisan"クラスを作成 */
public class Kilogram_Keisan
{
    public static void main(String[] args)
    {
        /* 　　　オブジェクト生成 　　 */
        Scanner input = new Scanner(System.in);

        /* Kilogram_Per_Pound変数を宣言 */
        /*      1lb = 0.454kg      */
        final double Kilogram_Per_Pound = 0.454;

        /* ポンド(lb)からを入力 */
        System.out.print("Enter a number in pounds: ");

        /* ポンド(lb)を宣言(一回目入力の値) */
        double lp = input.nextDouble();

        /* キログラム(kg)に変換:kg = lb * 0.454 */
        double kg = lp * Kilogram_Per_Pound;

        /* 結果を出力 */
        System.out.println(lp + " pounds is " + kg + " kilograms");
    }
}

/*===================================================================*/
/* END */
/*===================================================================*/